{
    "en": {
        "title": "DAL's data modification",
        "info_description": "   This program is designed to retrieve raw data from the DAL, process it, and generate various files.\n\n   The program produces an initial file allowing human verification of the data for each cow's passage. This initial file contains all the data and is called DB_PAO.csv (1)\n   After this verification, the program generates the SICPA file (2) or processes the file by aggregating the drinking data for each day to produce a file suitable for statistical analysis (3). It is possible to delete incomplete weeks (4)\n\n   The 'i' button next to each input field provides a description of the required information and the format in which it should be entered.",
        "language_info": "Here, you can change the interface language.",
        "zip_file_label": "Zip file:",
        "zip_file_info": "Import the file in .zip format containing the raw DAL data using the search button on the right",
        "cow_block_label": "Birth dates:",
        "cow_block_info": "Enter the birth date range of the block of cows studied in dd/mm/yyyy format",
        "easter_egg_title":"Easter egg",
        "easter_egg_message":"You find me!!",
        "easter_egg_emoji":"😉😁",
        "from": "From",
        "to": "To",
        "browse": "Browse",
        "IPG_label": "IPG number:",
        "IPG_info": "Enter the breeding number (IPG) of the group of animals (e.g., FR371783). This corresponds to the electronic tag number WITHOUT the order number (the last 4 digits)",
        "nb_sem": "Number of weeks:",
        "nb_sem_info": "You must specify the number of weeks (in numbers) that the experiment lasted (the number of weeks in the lactation plan).",
        "refresh": "Refresh",
        "refresh_info": "By clicking this button, the program will retrieve the numbers of all the feeding curves used during the experiment. Each curve must be associated with a feed name, a number of weeks, a theoretical amount of milk per day, and a number of meals, for each week.",
        "table_info": "You will see a table appear with tabs on the right titled with the curve numbers from the DAL. Each curve must be associated with a feed name defined in SICPA alimentation, a theoretical amount of milk per day, and a number of meals per day, for all weeks of the feeding plan. By default, if no information is provided, the interface retains the theoretical value of zero.",
        "aliment_label": "Feed used:",
        "aliment_info": "You must specify the feed code previously created in SICPA (e.g., PAO-2019-001-AUT corresponding to Univor Premium at a concentration of 115g/l).",
        "sem": "Week",
        "weeks": "Weeks",
        "liter": "Liters",
        "passsage": "Passages",
        "extract": "Extract:",
        "extract_info": "You must check the types of output files chosen and indicate the extraction location for each one selected :\n   1-DB_PAO: database with each drink PAO.\n\n   2-SICPA: data format per drink for exportation to SICPA Influx.db.\n\n   3-Statistiques: data format aggregated per day for statistical analysis.\n\n   4-Semaines complètes: data format aggregated per day with incomplete weeks removed for weekly averages.",
        "extract_button": "By clicking this button, you will extract the files selected above to the specified location.",
        "zip_path_error": "The file is not a valid zip file",
        "zip_error": "The file is not a .zip file",
        "num_week": "You must enter an integer for the number of weeks.",
        "week": "You must specify the number of weeks the experiment lasted. It cannot be 0.",
        "directory": "You must provide the path to a directory.",
        "date": "You must write the date in dd/mm/yyyy format.",
        "date_order": "You must provide a start date, then an end date. The earlier date must be before the later date.",
        "table_fill": "You must fill in all fields in the table with values (integer or decimal numbers with a point as the decimal separator)."
    },
    "fr": {
        "title": "Modification des données DAL",
        "info_description": "   Ce programme est conçu pour récupérer les données brutes du DAL, les traiter et générer différents fichiers.\n\n   Le programme produit un fichier initial permettant la vérification humaine des données pour chaque passage de vache. Ce fichier initial contient toutes les données, il s’appelle DB_PAO.csv (1)\n   Après cette vérification, le programme génère le fichier SICPA (2) ou traite le fichier en cumulant les données de buvées pour chaque jour pour produire un fichier propre aux analyses statistiques (3). Il est possible de supprimer les semaines incomplètes (4)\n\n   Le bouton 'i' à côté de chaque champ de saisie fournit une description des informations requises et du format dans lequel elles doivent être saisies.",
        "language_info": "ici, il est possible de changer la langue de l'interface.",
        "zip_file_label": "Fichier Zip:",
        "zip_file_info": "Importez le fichier au format .zip contenant les données brutes du DAL en utilisant le bouton de recherche à droite",
        "cow_block_label": "Dates de naissance:",
        "cow_block_info": "Entrez la plage de dates de naissance du bloc de vaches étudiées au format jj/mm/aaaa",
        "easter_egg_title":"Easter egg",
        "easter_egg_message":"Vous m'avez trouvé!!",
        "easter_egg_emoji":"😉😁",
        "from": "du",
        "to": "au",
        "browse":"Rechercher",
        "IPG_label": "Numéro IPG:",
        "IPG_info": "Entrez le numéro d'élevage (IPG) du groupe d'animaux (ex:FR371783). Cela correspond au numéro de la boucle électronique SANS le numéro d’ordre (les 4 derniers chiffres)",
        "nb_sem": "Nombre de semaines:",
        "nb_sem_info": "Vous devez renseigner le nombre de semaines (en chiffres) que l'expérimentation a duré (le nombre de semaine du plan de lactation).",
        "refresh": "Rafraîchir",
        "refresh_info": "En cliquant sur ce bouton, le programme va récupérer les numéros de toutes les courbes d'alimentation utilisées au cours de l’expérimentation. A chaque courbe, il devra être associé un nom d’aliment, un nombre de semaine, une quantité de lait théorique par jour et un nombre de repas, pour chaque semaine",
        "table_info":"Vous allez voir apparaitre un tableau avec sur la droite des onglets avec pour titre les numéros de courbe provenant du DAL. A chaque courbe, il devra être associé un nom d’aliment défini dans SICPA alimentation, une quantité de lait théorique par jour et un nombre de repas par jour, pour toutes les semaines du plan d'alimentation. Par défaut, si aucune information n'est renseignée, l'interface conserve la valeur théorique zéro.",
        "aliment_label": "Aliment utilisé:",
        "aliment_info": "Vous devez renseigner le code de l'aliment selon préalablement créé dans SICPA (ex:PAO-2019-001-AUT correspondant à l’Univor Premium à la concentration de 115g/l).",
        "sem": "Sem",
        "weeks": "Semaines",
        "liter": "Litres",
        "passsage": "Passages",
        "extract": "Extraire:",
        "extract_info": "Vous devez cocher les types de fichiers de sortie choisis et indiquer le lieu d'extraction pour chaque format de fichier sélectionné. 1-DB_PAO: format base de données par buvée PAO ; 2-SICPA: format données par buvée pour exportation vers SICPA Influx.db ; 3-Statistiques: format données cumulées par jour pour analyse statistique ; 4-Semaines complètes:  format données cumulées par jour avec semaines incomplètes supprimées pour pouvoir faire des moyennes par semaine",
        "extract_button": "En cliquant sur ce bouton, vous allez extraire les fichiers sélectionnés ci-dessus à l'endroit renseigné",
        "zip_path_error": "Le fichier n'est pas un fichier zip valide",
        "zip_error": "Le fichier n'est pas un fichier .zip",
        "num_week": "Vous devez entrer un entier pour le nombre de semaines.",
        "week": "Vous devez écrire le nombre de semaines que l'expérimentation a duré. Cela ne peut pas être 0.",
        "directory": "Vous devez fournir le chemin d'un répertoire.",
        "date": "Vous devez écrire la date au format jj/mm/aaaa.",
        "date_order": "Vous devez fournir une date de début, puis une date de fin. La date antérieure doit être avant la date ultérieure.",
        "table_fill": "Vous devez remplir tous les champs du tableau avec des valeurs (nombres entiers ou nombre décimaux avec un point comme séparateur décimal)."
    }
}
